{
    "th-TH": {
        "alert_about": "เพิ่มประสิทธิภาพและซุปเปอร์ขั้นตอนการพัฒนาทางลัดของคุณโดย:\n\n•ทางลัดการฝังภายในทางลัดอื่นๆ\n\n•สกัดบล็อกการดำเนินการจากทางลัด\n\n•การบันทึกการดำเนินการบล็อกไลบรารีการกระทำ",
        "alert_action_comment": "เพื่อฝังการกระทำนี้ลงในทางลัดให้เพิ่มการดำเนินการข้อคิดเห็นด้วยบรรทัดข้อความต่อไปนี้ซึ่งถูกคัดลอกไปยังคลิปบอร์ดของคุณ:",
        "alert_donate": "ขอบคุณสำหรับการบริจาคและสนับสนุนการพัฒนาทางลัดของฉันเช่น ActionCuts!",
        "alert_donate_title": "ขอบคุณ!",
        "alert_help_1": "ActionCuts เป็นเครื่องมือที่จำเป็นสำหรับนักพัฒนาที่ทำให้ทางลัดที่ซับซ้อนและใช้ซ้ำได้ การกระทำที่สามารถ:\n\n•แทรกทางลัดหรือบล็อกการดำเนินการภายในของทางลัดอื่นๆ\n\n•สกัดบล็อกการดำเนินการจากทางลัด\n\n•บันทึกบล็อกการดำเนินการในห้องสมุด\n\nการพัฒนาทางลัดได้รับง่ายขึ้นมากกับ ActionCuts!",
        "alert_help_1_title": "การกระทำการตัดภาพรวม",
        "alert_help_2": "ActionCuts works by looking for specially-formatted comments in a shortcut. It replaces the comment with the complete contents of another shortcut or an action block from the ActionCuts Library.\n\nEach comment contains a single line of text:\n\n{{ActionCuts Shortcut:XYZ}}\n\nor\n\n{{ActionCuts Action:XYZ}}\n\nwhere XYZ is the name of the shortcut or action block to embed.",
        "alert_help_2_title": "การ ActionCuts รูปแบบความคิดเห็นที่ฝัง",
        "alert_help_3": "ทำตามขั้นตอนเหล่านี้เพื่อฝังทางลัดและบล็อกการดำเนินการลงในทางลัด:\n\n1. เพิ่มการ ActionCuts ความคิดเห็นที่ฝังไปยังทางลัดเป้าหมาย\n\n2. เปิดการถูกตัด\n\n3) แตะฝังทางลัด\n\n4. เลือกทางลัดเป้าหมาย\n\nการกระทำใดๆที่ฝังข้อคิดเห็นในทางลัดจะถูกประมวลผลและแทนที่ด้วยทางลัดที่อ้างอิงหรือบล็อกการดำเนินการที่ให้พวกเขามีอยู่ในอุปกรณ์ iOS",
        "alert_help_3_title": "การฝังทางลัดและการดำเนินการ",
        "alert_help_4": "You can extract a block of actions from an existing shortcut and create a new shortcut or save to the ActionCuts Library.\n\n1. In your shortcut, surround the actions you want to extract with two comments:\n\n{{ActionCuts Extract:XYZ}}\n\n… the actions to extract …\n\n{{/ActionCuts Extract:XYZ}}\n\nwhere XYZ is the name of your action block\n\n2. Open ActionCuts.\n\n3. Tap Extract Actions.\n\n4. Select the shortcut from Step 1.\n\n5. Save the action block in a new shortcut or into the ActionCuts Library.",
        "alert_help_4_title": "การแยกการดำเนินการ",
        "alert_help_5": "หลังจากที่เรียกใช้คำสั่งฝังทางลัดหรือการดำเนินการแยกการ ActionCuts จะช่วยให้คุณมีตัวเลือกในการสร้างทางลัดใหม่\n\n1) แตะดาวน์โหลดทางลัด\n\n2. การเชื่อมโยงไปยังทางลัดจะถูกสร้างขึ้นบน iCloud.com\n\n3. มือถือ Safari จะเปิดไปที่หน้าดาวน์โหลด\n\n4. แตะที่การเชื่อมโยงเพื่อเปิดทางลัด\n\n5. แตะเพิ่มทางลัดที่ไม่น่าเชื่อถือที่ด้านล่างของทางลัดเพื่อเพิ่มลงในคลังทางลัดของคุณ",
        "alert_help_5_title": "การบันทึกทางลัดและการกระทำ",
        "alert_localization": "ต้องการดู ActionCuts ที่แปลเป็นภาษาท้องถิ่นของคุณหรือไม่\n\nไปที่หน้าการแปลสำหรับรายละเอียดเพิ่มเติม",
        "alert_update_none": "คุณกำลังเรียกใช้การ ActionCuts รุ่นล่าสุด",
        "error_extract_nothing": "ไม่พบความเห็นของสารสกัดจากการกระทำในทางลัดนี้",
        "error_library_none": "คุณไม่มีการดำเนินการที่บันทึกไว้ ใช้คำสั่งแยกการดำเนินการเพื่อบันทึกการดำเนินการที่ใช้กันทั่วไปจากทางลัดของคุณในไลบรารีการดำเนินการ",
        "language_key": "th-TH",
        "language_name": "Thai",
        "menu_about": "เกี่ยวกับ",
        "menu_action_blocks": "กลับไปที่บล็อกการดำเนินการ",
        "menu_action_comment": "คัดลอกความคิดเห็นเกี่ยวกับการตัดคำ",
        "menu_action_delete": "ลบการดำเนินการ ...",
        "menu_action_download": "ดาวน์โหลดเป็นทางลัด ...",
        "menu_action_home": "กลับไปยังการทำหน้าแรก",
        "menu_action_library": "กลับไปที่ไลบรารีการดำเนินการ",
        "menu_action_view": "ดูบล็อกการดำเนินการ ...",
        "menu_back": "ย้อนกลับ",
        "menu_delete_cancel": "ไม่ต้องลบ",
        "menu_delete_confirm": "ลบ",
        "menu_donate": "บริจาค",
        "menu_donate_already": "ฉันบริจาคแล้ว",
        "menu_donate_confirm": "บริจาคตอนนี้ ...",
        "menu_donate_later": "บริจาคในภายหลัง",
        "menu_extract": "แยกการดำเนินการ ...",
        "menu_extract_action": "บันทึกเป็นการดำเนินการ ...",
        "menu_extract_shortcut": "ดาวน์โหลดเป็นทางลัด ...",
        "menu_help": "วิธีใช้",
        "menu_help_1": "ภาพรวม",
        "menu_help_2": "การ ActionCuts รูปแบบความคิดเห็น",
        "menu_help_3": "การฝังช็อตคัต",
        "menu_help_4": "การแยกการดำเนินการ",
        "menu_help_5": "การบันทึกทางลัดและการกระทำ",
        "menu_help_6": "เอกสารประกอบทั้งหมด ...",
        "menu_home": "การกระทำการตัดหน้าแรก",
        "menu_language": "เปลี่ยนภาษา",
        "menu_library": "การดำเนินการของไลบรารี ...",
        "menu_quit": "ปิด",
        "menu_replace_cancel": "อย่าแทนที่",
        "menu_replace_confirm": "แทนที่การกระทำ",
        "menu_settings": "การตั้งค่า",
        "menu_shortcut": "ฝังทางลัด ...",
        "menu_success_diff": "แสดงความแตกต่าง ...",
        "menu_success_download": "ดาวน์โหลดทางลัด ...",
        "menu_update": "ตรวจหาการปรับปรุง ...",
        "menu_update_available": "ปรับปรุงการกระทำการตัด ...",
        "menu_update_available_description": "รุ่นใหม่ที่มีอยู่!",
        "menu_update_later": "ปรับปรุงในภายหลัง",
        "menu_update_now": "อัพเดตเดี๋ยวนี้",
        "prompt_action_delete": "ลบบล็อกการดำเนินการนี้หรือไม่ การดำเนินการนี้ไม่สามารถเลิกทำได้",
        "prompt_action_name": "ป้อนชื่อสำหรับบล็อกการดำเนินการนี้:",
        "prompt_donate": "คุณได้รับความเพลิดเพลินกับวิธีการ ActionCuts ได้เพิ่มประสิทธิภาพและความคล่องตัวในการพัฒนาทางลัดการเขียนของคุณหรือไม่\n\nถ้าเป็นเช่นนั้นลองส่งคำแนะนำให้ฉันเป็นโทเค็นของความชื่นชม!",
        "prompt_extract": "เลือกบล็อกการดำเนินการที่จะแยก:",
        "prompt_extract_success": "เลือกการดำเนินงานเพื่อดำเนินการกับบล็อกการดำเนินการที่ดึงออก:",
        "prompt_file_duplicate": "บล็อกการดำเนินการที่มีอยู่กับ anme เดียวกัน แทนที่บล็อกการดำเนินการที่เก่ากว่าด้วยอีกครั้ง",
        "prompt_help": "การกระทำความช่วยเหลือ",
        "prompt_language": "เลือกภาษา:",
        "prompt_library": "เลือกการดำเนินการจากไลบรารีการดำเนินการ:",
        "prompt_noMatches": "ไม่พบสิ่งใดที่จะแทรกลงใน:\n\n{{ทางลัด}}",
        "prompt_settings": "การตั้งค่าการตัด",
        "prompt_shortcut": "เลือกทางลัด:",
        "prompt_shortcut_name": "ป้อนชื่อสำหรับทางลัดใหม่นี้:",
        "prompt_success": "{{ทางลัด}} ถูกปรับปรุงเพื่อรวมทางลัดต่อไปนี้:\n\n{{ที่ตรงกัน}}",
        "prompt_success_unmatched": "\nไม่สามารถฝังทางลัดต่อไปนี้ได้เนื่องจากไม่มีอยู่บนอุปกรณ์ iOS เครื่องนี้:\n\n{{ไม่มีใครเทียบ}}",
        "prompt_update": "การกระทำการรุ่น {{เวอร์ชัน}} จะพร้อมใช้งาน คุณต้องการดาวน์โหลดเดี๋ยวนี้หรือไม่\n\nบันทึกย่อประจำรุ่น\n\n{{หมายเหตุ}}"
    }
}